export let data = {
  root: "你出生了，你面临着选择，你是想生活在当富二代家庭里还是一个知识分子家庭呢？",
  leftText: "富二代家庭",
  rightText: "知识分子家庭",
  left: {
    root: "你高二的时候爱上了一位姑娘，身为一个在富有且传统的家庭长大的孩子，因为此事，家庭矛盾极其严重，且对你的前程确实不利，你不得不在“前程”和她之间做出选择。",
    leftText: "我的前程",
    rightText: "心爱的她",
    left: {
      root: "你放弃了她，你如愿以偿考上了985大学，你希望自己读什么专业呢？",
      leftText: "无所谓，随便挑吧",
      rightText: "时下热门专业",
      left: {
        root: "你没赶上热门的行情，好在你有个好爹，接触上流资本圈子，有着小靠山，做起了传统行业生意，但天有不测风云，新冠疫情导致工厂倒闭，原材料堆积，工人们被欠薪，你此时必须做出抉择",
        leftText: "与父亲商量，跑路要紧🏃🏻‍♀️",
        rightText: "负债发薪，将工厂关闭，暂待春暖花开之时",
        left: {
          root: "新冠疫情持续了五年之久，你们一家不敢出门有大动作，所有生意都不好做，积蓄也快用尽，你的老婆因为日益下降的生活条件提出了离婚，孩子抚养问题上你们很难达成一致，那么你选择。。。",
          leftText: "坚持要抚养一儿一女",
          rightText: "孩子对我真没那么重要，算了",
          left: {
            root: "从没打过工得你，凭借自己还算高的学历，进了一家事业单位，每天朝九晚五，下班继续兼职挣钱，为儿女创造更好的生活条件，每天晚上十点到家的你，你觉得汗水在幸福面前不值一提，脚踏实地的人生竟然是如此模样",
            leftText: "",
            rightText: "",
            left: {},
            right: {},
          },
          right: {
            left: {
              root: "缺少了妻子和孩子的陪伴，过着恬淡的生活，你知道了人生永远是自在取一舍九，你向往着灯红酒绿，同样向往着家人陪伴，你不喜欢新的妻子，你觉得你们之间总是少了点什么，与其周五晚上早点回家，你更渴望在儿子学校栅栏边，多跟他交流交流",
              leftText: "",
              rightText: "",
              left: {},
              right: {},
            },
          },
        },
        right: {
          root: "你负债累累，妻离子散，电视剧导演都想采访采访你找寻灵感，你下定决心要脚踏实地把自己的债都还上，两年之后，你遇到了当时工厂的值班小晴，她一直喜欢你的性格，你这个人，她也说不清。你觉得在你最困难的时候遇见这样的女孩，真是你的福分。你与她更坚定了脚下的道路，准备照顾彼此共度余生。",
          leftText: "与父亲商量，逃跑要紧",
          rightText: "负债发薪，将工厂关闭，暂待春暖花开之时",
          left: {},
          right: {},
        },
      },
      right: {
        root: "你选中了热门专业！你拿着不错的薪资，小有自信，通过父亲的关系轻松变成金融圈大佬，你早就找到财富密码，由于国家监管不严，潘多拉魔盒一打开就再也无法关闭，源源不断的财富，权利向你招手，你狂妄无比，在家庭的劝阻下",
        leftText: "立刻停止不安全的操作",
        rightText: "人生得意须尽欢",
        left: {
          root: "你走上了稳定的生活，身边的朋友逐渐如潮水般褪去，异性朋友也慢慢消失，由奢入俭难，你的妻子离你而去。你很不适应这种生活，调整几年之后，你在小区遛狗的时候遇到了你现在的妻子小晴，你们即使结婚已经八年了，她还是经常开玩笑说当时只是看上了你的狗狗而已啦，然后就被你骗走了",
          leftText: "",
          rightText: "",
          left: {},
          right: {},
        },
        right: {
          root: "五年过后，国家法律逐渐健全，你却越来越无法停止自己财富的扩张，成为国家重点打击对象，你被没收全部资产，由奢入俭难，你的妻子离你而去，你的自负与自尊的剥离，你准备结束自己的生命",
          leftText: "",
          rightText: "",
          left: {},
          right: {},
        },
      },
    },
    right: {
      root: "",
      left: {
        root: "2",
        left: {},
        right: {},
      },
      right: {
        root: "2",
        left: {},
        right: {},
      },
    },
  },
  right: {
    root: "你高二的时候爱上了一位姑娘，身为一个传统家庭长大的孩子，因为此事，家庭矛盾极其严重，且对你的前程确实不利，你不得不在“前程”和她之间做出选择。",
    leftText: "我的前程",
    rightText: "心爱的她",
    left: {
      root: "你放弃了她，你如愿以偿考上了985大学，你希望自己读什么专业呢？",
      leftText: "时下热门专业",
      rightText: "无所谓，随便挑吧",
      left: {
        root: "你选中了热门专业！你拿着不错的薪资，小有自信，准备靠自己的能力在大城市买房，但时来运转，你遭遇经济危机被裁员，面临着负债的危险，此时你",
        leftText: "挺住，继续找工作",
        rightText: "回家吧少年",
        left: {
          root: "你足足失业了一年，才重新找到一份差不多的工作，你和妻子换了小房子，她决定和你患难与共，躲过这次寒潮，失业期重新照顾身心俱疲的你。你曾经是乐观的享乐主义者，什么事向钱看齐。失业之后，你妻子的举动让你觉得她是你这辈子最宝贵的财富，值得一生去守护",
          leftText: "",
          rightText: "",
          left: {},
          right: {},
        },
        right: {},
      },
      right: {
        root: "2",
        left: {},
        right: {},
      },
    },
    right: {
      root: "2",
      left: {
        root: "2",
        left: {},
        right: {},
      },
      right: {
        root: "2",
        left: {},
        right: {},
      },
    },
  },
};
